PreProcessing/modules/tunnelToCurvedPlateModule/airfoilLECase/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    airfoil
    {
        type            zeroGradient;
    }
    farfield
    {
        type            zeroGradient;
    }
    suctionOutlet
{
    type            timeVaryingMappedFixedValue;
    offset          0;
    setAverage      false;
    value           uniform 0;
}
    pressureOutlet
{
    type            timeVaryingMappedFixedValue;
    offset          0;
    setAverage      false;
    value           uniform 0;
}
    front
    {
        type            cyclic;
    }
    back
    {
        type            cyclic;
    }
}

// ************************************************************************* //
