PreProcessing/modules/tunnelToCurvedPlateModule/airfoilLECase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Generated by generate_cgrid.jl  (221airfoilTopBottom)
//
// C-grid parameters:
//   chord      = 900.0 mm,  AoA = -3.017 deg
//   xi_arch    = 0.02
//   xi_suction = 0.5,  xi_pressure = 0.08
//   H_BL       = 280.0 mm,  H_far = 280.0 mm
//   segments   = 6+2+1+2+2  (suction+archUp+LE+archLo+pressure)
//   total blocks = 24
//   cosine arch = true

scale 0.001;   // vertices in mm → metres

vertices
(
    (    -4.25615453     80.75381682     -1.00000000 )   // 0
    (   -77.02055738     74.43425960     -1.00000000 )   // 1
    (  -149.50004186     65.39244070     -1.00000000 )   // 2
    (  -221.62308973     53.86183215     -1.00000000 )   // 3
    (  -293.25776475     39.61055379     -1.00000000 )   // 4
    (  -364.03455443     21.60581679     -1.00000000 )   // 5
    (  -432.40350549     -3.72057072     -1.00000000 )   // 6
    (  -441.11774928     -9.37935342     -1.00000000 )   // 7
    (  -449.37628308    -23.68451398     -1.00000000 )   // 8
    (  -439.65976556    -37.04229397     -1.00000000 )   // 9
    (  -430.39895803    -41.75369612     -1.00000000 )   // 10
    (  -403.30120494    -50.39467332     -1.00000000 )   // 11
    (  -375.53449558    -56.73345070     -1.00000000 )   // 12
    (   -22.70659934    360.14526459     -1.00000000 )   // 13
    (  -107.19449143    352.80367908     -1.00000000 )   // 14
    (  -188.02989067    342.72879019     -1.00000000 )   // 15
    (  -270.90220866    329.49123631     -1.00000000 )   // 16
    (  -354.07162960    312.91482460     -1.00000000 )   // 17
    (  -443.12701701    290.20288000     -1.00000000 )   // 18
    (  -564.42221735    243.20261515     -1.00000000 )   // 19
    (  -622.79714590    203.67603103     -1.00000000 )   // 20
    (  -728.98819256    -38.42154490     -1.00000000 )   // 21
    (  -597.93651732   -268.01517085     -1.00000000 )   // 22
    (  -535.73002445   -301.18647440     -1.00000000 )   // 23
    (  -476.05867436   -320.77653411     -1.00000000 )   // 24
    (  -430.40860335   -331.30371911     -1.00000000 )   // 25
    (   -41.15704415    639.53671236     -1.00000000 )   // 26
    (  -137.36842549    631.17309857     -1.00000000 )   // 27
    (  -226.55973948    620.06513969     -1.00000000 )   // 28
    (  -320.18132759    605.12064047     -1.00000000 )   // 29
    (  -414.88799596    586.23033748     -1.00000000 )   // 30
    (  -522.21947960    558.79994320     -1.00000000 )   // 31
    (  -696.44092921    490.12580102     -1.00000000 )   // 32
    (  -804.47654252    416.73141548     -1.00000000 )   // 33
    ( -1008.60010203    -53.15857582     -1.00000000 )   // 34
    (  -756.21326908   -498.98804773     -1.00000000 )   // 35
    (  -641.06109087   -560.61925268     -1.00000000 )   // 36
    (  -548.81614378   -591.15839490     -1.00000000 )   // 37
    (  -485.28271112   -605.87398752     -1.00000000 )   // 38
    (    -4.25615453     80.75381682      1.00000000 )   // 39
    (   -77.02055738     74.43425960      1.00000000 )   // 40
    (  -149.50004186     65.39244070      1.00000000 )   // 41
    (  -221.62308973     53.86183215      1.00000000 )   // 42
    (  -293.25776475     39.61055379      1.00000000 )   // 43
    (  -364.03455443     21.60581679      1.00000000 )   // 44
    (  -432.40350549     -3.72057072      1.00000000 )   // 45
    (  -441.11774928     -9.37935342      1.00000000 )   // 46
    (  -449.37628308    -23.68451398      1.00000000 )   // 47
    (  -439.65976556    -37.04229397      1.00000000 )   // 48
    (  -430.39895803    -41.75369612      1.00000000 )   // 49
    (  -403.30120494    -50.39467332      1.00000000 )   // 50
    (  -375.53449558    -56.73345070      1.00000000 )   // 51
    (   -22.70659934    360.14526459      1.00000000 )   // 52
    (  -107.19449143    352.80367908      1.00000000 )   // 53
    (  -188.02989067    342.72879019      1.00000000 )   // 54
    (  -270.90220866    329.49123631      1.00000000 )   // 55
    (  -354.07162960    312.91482460      1.00000000 )   // 56
    (  -443.12701701    290.20288000      1.00000000 )   // 57
    (  -564.42221735    243.20261515      1.00000000 )   // 58
    (  -622.79714590    203.67603103      1.00000000 )   // 59
    (  -728.98819256    -38.42154490      1.00000000 )   // 60
    (  -597.93651732   -268.01517085      1.00000000 )   // 61
    (  -535.73002445   -301.18647440      1.00000000 )   // 62
    (  -476.05867436   -320.77653411      1.00000000 )   // 63
    (  -430.40860335   -331.30371911      1.00000000 )   // 64
    (   -41.15704415    639.53671236      1.00000000 )   // 65
    (  -137.36842549    631.17309857      1.00000000 )   // 66
    (  -226.55973948    620.06513969      1.00000000 )   // 67
    (  -320.18132759    605.12064047      1.00000000 )   // 68
    (  -414.88799596    586.23033748      1.00000000 )   // 69
    (  -522.21947960    558.79994320      1.00000000 )   // 70
    (  -696.44092921    490.12580102      1.00000000 )   // 71
    (  -804.47654252    416.73141548      1.00000000 )   // 72
    ( -1008.60010203    -53.15857582      1.00000000 )   // 73
    (  -756.21326908   -498.98804773      1.00000000 )   // 74
    (  -641.06109087   -560.61925268      1.00000000 )   // 75
    (  -548.81614378   -591.15839490      1.00000000 )   // 76
    (  -485.28271112   -605.87398752      1.00000000 )   // 77
);

blocks
(
    hex (39 40 53 52 0 1 14 13)  (108 400 2) simpleGrading (1 200 1)   // block 0
    hex (52 53 66 65 13 14 27 26)  (108 75 2) simpleGrading (1 1 1)   // block 1
    hex (40 41 54 53 1 2 15 14)  (108 400 2) simpleGrading (1 200 1)   // block 2
    hex (53 54 67 66 14 15 28 27)  (108 75 2) simpleGrading (1 1 1)   // block 3
    hex (41 42 55 54 2 3 16 15)  (108 400 2) simpleGrading (1 200 1)   // block 4
    hex (54 55 68 67 15 16 29 28)  (108 75 2) simpleGrading (1 1 1)   // block 5
    hex (42 43 56 55 3 4 17 16)  (108 400 2) simpleGrading (1 200 1)   // block 6
    hex (55 56 69 68 16 17 30 29)  (108 75 2) simpleGrading (1 1 1)   // block 7
    hex (43 44 57 56 4 5 18 17)  (108 400 2) simpleGrading (1 200 1)   // block 8
    hex (56 57 70 69 17 18 31 30)  (108 75 2) simpleGrading (1 1 1)   // block 9
    hex (44 45 58 57 5 6 19 18)  (108 400 2) simpleGrading (1 200 1)   // block 10
    hex (57 58 71 70 18 19 32 31)  (108 75 2) simpleGrading (1 1 1)   // block 11
    hex (45 46 59 58 6 7 20 19)  (10 400 2) simpleGrading (2.21684 200 1)   // block 12
    hex (58 59 72 71 19 20 33 32)  (10 75 2) simpleGrading (2.21684 1 1)   // block 13
    hex (46 47 60 59 7 8 21 20)  (34 400 2) simpleGrading (0.0564141 200 1)   // block 14
    hex (59 60 73 72 20 21 34 33)  (34 75 2) simpleGrading (0.0564141 1 1)   // block 15
    hex (47 48 61 60 8 9 22 21)  (34 400 2) simpleGrading (17.7261 200 1)   // block 16
    hex (60 61 74 73 21 22 35 34)  (34 75 2) simpleGrading (17.7261 1 1)   // block 17
    hex (48 49 62 61 9 10 23 22)  (9 400 2) simpleGrading (0.575231 200 1)   // block 18
    hex (61 62 75 74 22 23 36 35)  (9 75 2) simpleGrading (0.575231 1 1)   // block 19
    hex (49 50 63 62 10 11 24 23)  (33 400 2) simpleGrading (1 200 1)   // block 20
    hex (62 63 76 75 23 24 37 36)  (33 75 2) simpleGrading (1 1 1)   // block 21
    hex (50 51 64 63 11 12 25 24)  (33 400 2) simpleGrading (1 200 1)   // block 22
    hex (63 64 77 76 24 25 38 37)  (33 75 2) simpleGrading (1 1 1)   // block 23
);

edges
(
...
...
...
...
...
...
    polyLine 6 7 ( (  -434.53669209    -4.93598670    -1.00000000 ) (  -439.57435508    -8.24231295    -1.00000000 ) )
    polyLine 7 8 ( (  -443.57801497   -11.65636660    -1.00000000 ) (  -446.54020003   -15.14891387    -1.00000000 ) (  -448.45788747   -18.65760927    -1.00000000 ) (  -448.83669315   -20.45117417    -1.00000000 ) (  -449.10890281   -22.02202908    -1.00000000 ) (  -449.28739481   -23.12582741    -1.00000000 ) (  -449.34962474   -23.51675359    -1.00000000 ) )
    polyLine 8 9 ( (  -449.33213770   -23.84854263    -1.00000000 ) (  -449.22915893   -24.23076144    -1.00000000 ) (  -448.93562608   -25.30968155    -1.00000000 ) (  -448.49979847   -26.84321914    -1.00000000 ) (  -447.93455445   -28.58702762    -1.00000000 ) (  -445.65866242   -31.87469913    -1.00000000 ) (  -442.34575707   -35.03651585    -1.00000000 ) )
    polyLine 9 10 ( (  -438.00539813   -38.01079545    -1.00000000 ) (  -432.64808894   -40.76925151    -1.00000000 ) )
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
    polyLine 45 46 ( (  -434.53669209    -4.93598670     1.00000000 ) (  -439.57435508    -8.24231295     1.00000000 ) )
    polyLine 46 47 ( (  -443.57801497   -11.65636660     1.00000000 ) (  -446.54020003   -15.14891387     1.00000000 ) (  -448.45788747   -18.65760927     1.00000000 ) (  -448.83669315   -20.45117417     1.00000000 ) (  -449.10890281   -22.02202908     1.00000000 ) (  -449.28739481   -23.12582741     1.00000000 ) (  -449.34962474   -23.51675359     1.00000000 ) )
    polyLine 47 48 ( (  -449.33213770   -23.84854263     1.00000000 ) (  -449.22915893   -24.23076144     1.00000000 ) (  -448.93562608   -25.30968155     1.00000000 ) (  -448.49979847   -26.84321914     1.00000000 ) (  -447.93455445   -28.58702762     1.00000000 ) (  -445.65866242   -31.87469913     1.00000000 ) (  -442.34575707   -35.03651585     1.00000000 ) )
    polyLine 48 49 ( (  -438.00539813   -38.01079545     1.00000000 ) (  -432.64808894   -40.76925151     1.00000000 ) )
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
...
);

boundary
(
    airfoil
    {
        type wall;
        faces
        (
            (0 39 40 1)
            (1 40 41 2)
            (2 41 42 3)
            (3 42 43 4)
            (4 43 44 5)
            (5 44 45 6)
            (6 45 46 7)
            (7 46 47 8)
            (8 47 48 9)
            (9 48 49 10)
            (10 49 50 11)
            (11 50 51 12)
        );
    }

    farfield
    {
        type patch;
        faces
        (
            (26 27 66 65)
            (27 28 67 66)
            (28 29 68 67)
            (29 30 69 68)
            (30 31 70 69)
            (31 32 71 70)
            (32 33 72 71)
            (33 34 73 72)
            (34 35 74 73)
            (35 36 75 74)
            (36 37 76 75)
            (37 38 77 76)
        );
    }

    suctionOutlet
    {
        type patch;
        faces
        (
            (0 13 52 39)
            (13 26 65 52)
        );
    }

    pressureOutlet
    {
        type patch;
        faces
        (
            (12 25 64 51)
            (25 38 77 64)
        );
    }

    front
    {
        type cyclic;
        neighbourPatch  back;
        faces
        (
            (0 1 14 13)
            (13 14 27 26)
            (1 2 15 14)
            (14 15 28 27)
            (2 3 16 15)
            (15 16 29 28)
            (3 4 17 16)
            (16 17 30 29)
            (4 5 18 17)
            (17 18 31 30)
            (5 6 19 18)
            (18 19 32 31)
            (6 7 20 19)
            (19 20 33 32)
            (7 8 21 20)
            (20 21 34 33)
            (8 9 22 21)
            (21 22 35 34)
            (9 10 23 22)
            (22 23 36 35)
            (10 11 24 23)
            (23 24 37 36)
            (11 12 25 24)
            (24 25 38 37)
        );
    }

    back
    {
        type cyclic;
        neighbourPatch  front;
        faces
        (
            (39 40 53 52)
            (52 53 66 65)
            (40 41 54 53)
            (53 54 67 66)
            (41 42 55 54)
            (54 55 68 67)
            (42 43 56 55)
            (55 56 69 68)
            (43 44 57 56)
            (56 57 70 69)
            (44 45 58 57)
            (57 58 71 70)
            (45 46 59 58)
            (58 59 72 71)
            (46 47 60 59)
            (59 60 73 72)
            (47 48 61 60)
            (60 61 74 73)
            (48 49 62 61)
            (61 62 75 74)
            (49 50 63 62)
            (62 63 76 75)
            (50 51 64 63)
            (63 64 77 76)
        );
    }

);

mergePatchPairs
(
);

// ********************************************************** //
