PreProcessing/modules/tunnelToCurvedPlateModule/airfoilLECase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10000;

deltaT          1;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{ 
    solverInfo
    {
        type  solverInfo;
        libs  ("libutilityFunctionObjects.so");
        writeControl  timeStep;   // write every SIMPLE iteration
        writeInterval 1;

        fields (U p);             // track these fields' residuals
    }

    wallShearStress
    {
        type            wallShearStress;
        libs            ("libfieldFunctionObjects.so");
        executeControl  writeTime;
        writeControl    writeTime;
    }

    yPlus
    {
        type            yPlus;
        libs            ("libfieldFunctionObjects.so");
        executeControl  writeTime;
        writeControl    writeTime;
    }

    vorticity
    {
        type            vorticity;
        libs            ("libfieldFunctionObjects.so");
        executeControl  writeTime;
        writeControl    writeTime;
    }

    writeMidPlane
    {
        type            coded;
        libs            ("libutilityFunctionObjects.so");
        name            writeMidPlane;
        executeControl  writeTime;
        writeControl    none;

        codeInclude
        #{
            #include "OFstream.H"
            #include <fstream>
            #include <cmath>
            #include "Pstream.H"
            #include "fvcGrad.H"
        #};

        codeExecute
        #{
            const fvMesh& mesh = refCast<const fvMesh>(obr_);
            const volVectorField& U =
                mesh.lookupObject<volVectorField>("U");
            const volScalarField& p =
                mesh.lookupObject<volScalarField>("p");
            // Vorticity (volVectorField; only ω_z is meaningful on the 2D
            // mid-plane). blMetrics integrates ω_z wall-normal to get U_e.
            const volVectorField& vort =
                mesh.lookupObject<volVectorField>("vorticity");
            const vectorField& C = mesh.C();

            // ── Read parameters from inputParam ──
            IOdictionary inputParam
            (
                IOobject
                (
                    "inputParam", "constant", mesh,
                    IOobject::MUST_READ, IOobject::NO_WRITE
                )
            );
            const dictionary& d = inputParam.subDict("Upinlet");
            const word fmt      = d.lookupOrDefault<word>("outputFormat", "csv");
            const word mode     = d.lookupOrDefault<word>("exportMode", "full");
            const bool wallExtrap = d.lookupOrDefault<bool>("wallExtrapolation", false);

            // ── Mid-plane cell selection ──
            // nz=2, zWidth=2mm → expected cell center at z=0.0005 m
            const scalar zTarget   = 0.0005;
            const scalar zMatchTol = 1e-9;   // FP match for the chosen plane

            // Pick a SINGLE z-plane: the cell-center z closest to zTarget.
            // Picking the nearest cell-center z (rather than a tolerance
            // window |z - zTarget|<zTol) guarantees exactly one plane even
            // if the mesh ever has multiple cells inside any reasonable
            // tolerance window.
            scalar zPlane = zTarget;
            {
                scalar bestDz = GREAT;
                forAll(C, cellI)
                {
                    const scalar zi = C[cellI].z();
                    const scalar dz = mag(zi - zTarget);
                    if (dz < bestDz)
                    {
                        bestDz = dz;
                        zPlane = zi;
                    }
                }
                reduce(zPlane, minOp<scalar>());  // deterministic agreement across procs
            }

            DynamicList<label> midCells;
            forAll(C, cellI)
            {
                if (mag(C[cellI].z() - zPlane) < zMatchTol)
                {
                    midCells.append(cellI);
                }
            }

            // ── Final cell list (full or partial) ──
            DynamicList<label> cells;
            DynamicList<scalar> localWall;
            DynamicList<scalar> localWallQ;  // wall quantities: x, s, p, cf, yplus per face
            DynamicList<scalar> localWallExtrap;  // wall extrap: x,y,z,0,0,0,p per face

            if (mode == "partial")
            {
                // Read partial-export parameters
                const scalar xiInlet_   = d.lookupOrDefault<scalar>("xiInlet", 0.01);
                const scalar xiOutlet_  = d.lookupOrDefault<scalar>("xiOutlet", 0.10);
                const scalar expHeight  = d.lookupOrDefault<scalar>("exportHeight", 10.0);
                const scalar chord_     = d.lookupOrDefault<scalar>("chord", 900.0);
                const scalar alphaDeg_  = d.lookupOrDefault<scalar>("alphaDeg", -3.0);
                const scalar xCtr       = d.lookupOrDefault<scalar>("xCenter", 0.0);
                const scalar yCtr       = d.lookupOrDefault<scalar>("yCenter", 0.0);

                const scalar expHeightM = expHeight * 0.001;  // mm → m
                const scalar chordM     = chord_ * 0.001;     // mm → m
                const scalar xCtrM      = xCtr * 0.001;
                const scalar yCtrM      = yCtr * 0.001;

                // ── Read upper-surface airfoil data from inputParam ──
                const scalarField XI_D(d.lookup("airfoilXi"));
                const scalarField ETA_D(d.lookup("airfoilEta"));
                const int N_PTS = XI_D.size();

                // ── Geometry helper lambdas ──
                // Linear interpolation in sorted table
                auto interp1 = [](const scalarField& xd, const scalarField& yd,
                                  int n, double xq) -> double
                {
                    if (xq <= xd[0])   return yd[0];
                    if (xq >= xd[n-1]) return yd[n-1];
                    for (int i = 0; i < n - 1; ++i)
                    {
                        if (xd[i] <= xq && xq <= xd[i+1])
                        {
                            double t = (xq - xd[i]) / (xd[i+1] - xd[i]);
                            return (1.0 - t) * yd[i] + t * yd[i+1];
                        }
                    }
                    return yd[n-1];
                };

                auto etaUpper = [&](double xi) -> double
                {
                    return interp1(XI_D, ETA_D, N_PTS, xi);
                };

                // Transform (xi, eta) → global (x, y) in metres
                auto toGlobal = [&](double xi, double eta,
                                    double& xOut, double& yOut)
                {
                    double alpha = alphaDeg_ * M_PI / 180.0;
                    double ca = std::cos(alpha);
                    double sa = std::sin(alpha);
                    double Xp = xi  * chordM - 0.5 * chordM;
                    double Yp = eta * chordM;
                    double Xr =  ca * Xp + sa * Yp;
                    double Yr = -sa * Xp + ca * Yp;
                    xOut = xCtrM + Xr;
                    yOut = yCtrM + Yr;
                };

                // Outward surface normal on upper surface at xi
                auto surfaceNormal = [&](double xi, double& nx, double& ny)
                {
                    double delta = 1e-5;
                    double x0, y0, x1, y1;
                    toGlobal(std::max(0.0, xi - delta),
                             etaUpper(std::max(0.0, xi - delta)), x0, y0);
                    toGlobal(std::min(1.0, xi + delta),
                             etaUpper(std::min(1.0, xi + delta)), x1, y1);
                    double tx = x1 - x0;
                    double ty = y1 - y0;
                    // +90° rotation for upper surface outward normal
                    nx = -ty;
                    ny =  tx;
                    double mag = std::sqrt(nx*nx + ny*ny);
                    if (mag < 1e-15) { nx = 0.0; ny = 1.0; return; }
                    nx /= mag;
                    ny /= mag;
                };

                // ── Compute inlet boundary (normal line at xiInlet) ──
                double pInX, pInY, nInX, nInY;
                toGlobal(xiInlet_, etaUpper(xiInlet_), pInX, pInY);
                surfaceNormal(xiInlet_, nInX, nInY);
                // Tangent toward increasing xi
                double tInX =  nInY;
                double tInY = -nInX;

                // ── Compute outlet boundary (normal line at xiOutlet) ──
                double pOutX, pOutY, nOutX, nOutY;
                toGlobal(xiOutlet_, etaUpper(xiOutlet_), pOutX, pOutY);
                surfaceNormal(xiOutlet_, nOutX, nOutY);
                double tOutX =  nOutY;
                double tOutY = -nOutX;

                // ── Precompute upper-surface reference curve for arclength lookup ──
                // Sample xi ∈ [0,1] on a fine grid; cache (x_ref, y_ref) in
                // global coords and the cumulative arclength s_ref. The
                // resolution matches the Julia post-processor (≈ 0.15 mm).
                const int N_REF = 4001;
                scalarList xRef(N_REF), yRef(N_REF), sRef(N_REF);
                {
                    double xa, ya;
                    toGlobal(0.0, etaUpper(0.0), xa, ya);
                    xRef[0] = xa; yRef[0] = ya; sRef[0] = 0.0;
                    for (int k = 1; k < N_REF; ++k)
                    {
                        const double xiK = scalar(k) / scalar(N_REF - 1);
                        double xb, yb;
                        toGlobal(xiK, etaUpper(xiK), xb, yb);
                        xRef[k] = xb; yRef[k] = yb;
                        const double dxk = xb - xa, dyk = yb - ya;
                        sRef[k] = sRef[k-1] + std::sqrt(dxk*dxk + dyk*dyk);
                        xa = xb; ya = yb;
                    }
                }

                // Arclength at the projection of (fx, fy) on the upper surface.
                auto arclengthOf = [&](double fx, double fy) -> double
                {
                    int bestk = 0;
                    double bestd = GREAT;
                    for (int k = 0; k < N_REF; ++k)
                    {
                        const double dx = fx - xRef[k], dy = fy - yRef[k];
                        const double d2 = dx*dx + dy*dy;
                        if (d2 < bestd) { bestd = d2; bestk = k; }
                    }
                    return sRef[bestk];
                };

                // ── Get airfoil patch face centres & normals ──
                label patchID = mesh.boundaryMesh().findPatchID("airfoil");
                if (patchID < 0)
                {
                    FatalErrorInFunction
                        << "Patch 'airfoil' not found!" << abort(FatalError);
                }
                const polyPatch& pp = mesh.boundaryMesh()[patchID];
                const vectorField faceCentres(pp.faceCentres());
                const vectorField faceNormals(pp.faceNormals());

                // ── Filter mid-plane cells ──
                forAll(midCells, i)
                {
                    const label ci = midCells[i];
                    double cx = C[ci].x();
                    double cy = C[ci].y();

                    // (a) Downstream of inlet: dot(X - P_in, T_in) >= 0
                    double dotIn = (cx - pInX)*tInX + (cy - pInY)*tInY;
                    if (dotIn < 0) continue;

                    // (b) Upstream of outlet: dot(X - P_out, T_out) <= 0
                    double dotOut = (cx - pOutX)*tOutX + (cy - pOutY)*tOutY;
                    if (dotOut > 0) continue;

                    // (c) Distance to nearest airfoil face & suction-side check
                    double minDist = GREAT;
                    vector nearestNormal(0, 0, 0);
                    vector nearestFc(0, 0, 0);
                    forAll(faceCentres, fi)
                    {
                        // Only consider faces near the mid-plane
                        if (mag(faceCentres[fi].z() - zPlane) > zMatchTol) continue;
                        double dx = cx - faceCentres[fi].x();
                        double dy = cy - faceCentres[fi].y();
                        double dist = std::sqrt(dx*dx + dy*dy);
                        if (dist < minDist)
                        {
                            minDist = dist;
                            nearestNormal = faceNormals[fi];
                            nearestFc = faceCentres[fi];
                        }
                    }

                    if (minDist > expHeightM) continue;

                    // Suction side check: OpenFOAM boundary face normals
                    // point OUT of the fluid domain (into the wall).
                    // For fluid cells, toCell opposes faceNormal (dot < 0).
                    // Skip cells inside the body (dot > 0, shouldn't happen)
                    // and cells whose nearest face is on the pressure (lower)
                    // side: lower-surface normals point upward into the
                    // airfoil, so their y-component (flipped = outward from
                    // airfoil) is negative → skip those.
                    vector toCell = C[ci] - nearestFc;
                    if ((toCell & nearestNormal) > 0) continue;
                    // -nearestNormal = outward from airfoil; for upper-surface
                    // faces this points generally upward (positive y)
                    if (-nearestNormal.y() < 0) continue;

                    cells.append(ci);
                }

                // ── Collect wall face data in the exported region ──
                const fvPatchScalarField& pw = p.boundaryField()[patchID];
                // BC value of vorticity at the wall — for a no-slip patch
                // OpenFOAM computes this as curl(U) at the boundary face,
                // which equals -∂u/∂y (the wall shear gradient). Used in
                // the wallExtrap block below, mirroring DFP.
                const fvPatchVectorField& vortW = vort.boundaryField()[patchID];

                // OpenFOAM-computed y+ field and on-the-fly grad(U).
                // The signed ∂u/∂y at the wall is exported as the "dudy"
                // column; its sign change locates separation points (∂u/∂y > 0
                // attached → ∂u/∂y < 0 reverse flow).
                const volScalarField& yPlusField =
                    mesh.lookupObject<volScalarField>("yPlus");
                const scalarField& ypPatch  = yPlusField.boundaryField()[patchID];

                const volTensorField gradU(fvc::grad(U));
                const tensorField& gradU_patch =
                    gradU.boundaryField()[patchID];

                forAll(faceCentres, fi)
                {
                    if (mag(faceCentres[fi].z() - zPlane) > zMatchTol) continue;

                    double fx = faceCentres[fi].x();
                    double fy = faceCentres[fi].y();

                    double dotIn = (fx - pInX)*tInX + (fy - pInY)*tInY;
                    if (dotIn < 0) continue;
                    double dotOut = (fx - pOutX)*tOutX + (fy - pOutY)*tOutY;
                    if (dotOut > 0) continue;

                    // Suction side only
                    if (-faceNormals[fi].y() < 0) continue;

                    localWall.append(fx);
                    localWall.append(fy);

                    // Wall quantities from OpenFOAM fields
                    localWallQ.append(fx);
                    localWallQ.append(arclengthOf(fx, fy));  // s [m] along upper surface from xi=0
                    localWallQ.append(pw[fi]);               // p/ρ [m²/s²]
                    localWallQ.append(gradU_patch[fi].yx()); // ∂u/∂y [1/s] (signed; flips at separation)
                    localWallQ.append(ypPatch[fi]);
                }

                // ── Wall extrapolation: add wall face centres with u=v=w=0 ──
                // p is extrapolated from the two nearest interior cells (2nd order)
                if (wallExtrap)
                {
                    // Wall pressure and vorticity are taken from the patch BC
                    // values (pw[fi], vortW[fi].z()). For the standard
                    // zeroGradient pressure BC, pw[fi] equals the owner-cell
                    // pressure — the same value OpenFOAM integrates for force
                    // coefficients. The vorticity BC (calculated) evaluates
                    // curl(U) at the boundary face, giving -∂u/∂y at the
                    // wall. This replaces the previous 2-point linear
                    // extrapolation from interior cells, which was unreliable
                    // on a curved O-grid (cells passing the dt<3 mm
                    // tangential filter were not necessarily normal-stacked
                    // above the face, producing large p artefacts near the
                    // LE). Same approach as DFP.
                    forAll(faceCentres, fi)
                    {
                        if (mag(faceCentres[fi].z() - zPlane) > zMatchTol) continue;

                        double fx = faceCentres[fi].x();
                        double fy = faceCentres[fi].y();

                        double dotIn = (fx - pInX)*tInX + (fy - pInY)*tInY;
                        if (dotIn < 0) continue;
                        double dotOut = (fx - pOutX)*tOutX + (fy - pOutY)*tOutY;
                        if (dotOut > 0) continue;
                        if (-faceNormals[fi].y() < 0) continue;

                        localWallExtrap.append(fx);
                        localWallExtrap.append(fy);
                        localWallExtrap.append(faceCentres[fi].z());
                        localWallExtrap.append(0.0);  // u
                        localWallExtrap.append(0.0);  // v
                        localWallExtrap.append(0.0);  // w
                        localWallExtrap.append(pw[fi]);
                        localWallExtrap.append(vortW[fi].z());
                    }

                    Info<< "writeMidPlane: wall extrapolation — "
                        << localWallExtrap.size()/8 << " wall faces added" << endl;
                }

                Info<< "writeMidPlane: partial mode — "
                    << "xiInlet=" << xiInlet_ << " xiOutlet=" << xiOutlet_
                    << " exportHeight=" << expHeight << " mm"
                    << " → " << cells.size() << " cells, "
                    << localWall.size()/2 << " wall faces selected" << endl;
            }
            else
            {
                // Full mode: all mid-plane cells
                cells = midCells;
            }

            // ── Collect local data into a flat list ──
            List<scalar> localData(cells.size() * 8);
            forAll(cells, i)
            {
                const label ci = cells[i];
                localData[8*i + 0] = C[ci].x();
                localData[8*i + 1] = C[ci].y();
                localData[8*i + 2] = C[ci].z();
                localData[8*i + 3] = U[ci].x();
                localData[8*i + 4] = U[ci].y();
                localData[8*i + 5] = U[ci].z();
                localData[8*i + 6] = p[ci];
                localData[8*i + 7] = vort[ci].z();   // ω_z (spanwise)
            }

            // ── Gather all processor data on master ──
            List<List<scalar>> allData(Pstream::nProcs());
            allData[Pstream::myProcNo()] = localData;
            Pstream::gatherList(allData);

            List<List<scalar>> allWall(Pstream::nProcs());
            allWall[Pstream::myProcNo()] = localWall;
            Pstream::gatherList(allWall);

            List<List<scalar>> allWallQ(Pstream::nProcs());
            allWallQ[Pstream::myProcNo()] = localWallQ;
            Pstream::gatherList(allWallQ);

            // Wall extrapolation data (empty unless partial+wallExtrap mode)
            List<List<scalar>> allWallExtrap(Pstream::nProcs());
            allWallExtrap[Pstream::myProcNo()] = localWallExtrap;
            Pstream::gatherList(allWallExtrap);

            // ── Write output (master only) ──
            if (Pstream::master())
            {
                const fileName outDir =
                    mesh.time().globalPath()/"postProcessing";
                mkDir(outDir);

                // Count total rows (interior cells + wall extrapolation points).
                // Each row carries 8 scalars: x,y,z,u,v,w,p,omz
                label totalRows = 0;
                forAll(allData, proci)
                {
                    totalRows += allData[proci].size() / 8;
                }
                label nWallExtrap = 0;
                forAll(allWallExtrap, proci)
                {
                    nWallExtrap += allWallExtrap[proci].size() / 8;
                }
                totalRows += nWallExtrap;

                if (fmt == "binary")
                {
                    const fileName fpath = outDir/"midPlane.bin";
                    std::ofstream ofs(fpath, std::ios::binary);

                    int32_t nCols = 8;
                    int64_t nRows = totalRows;
                    ofs.write(reinterpret_cast<const char*>(&nCols), sizeof(nCols));
                    ofs.write(reinterpret_cast<const char*>(&nRows), sizeof(nRows));

                    // Interior cells
                    forAll(allData, proci)
                    {
                        const List<scalar>& pd = allData[proci];
                        for (label i = 0; i < pd.size(); i += 8)
                        {
                            double row[8];
                            for (int j = 0; j < 8; ++j) row[j] = pd[i+j];
                            ofs.write(reinterpret_cast<const char*>(row), sizeof(row));
                        }
                    }
                    // Wall extrapolation points
                    forAll(allWallExtrap, proci)
                    {
                        const List<scalar>& we = allWallExtrap[proci];
                        for (label i = 0; i < we.size(); i += 8)
                        {
                            double row[8];
                            for (int j = 0; j < 8; ++j) row[j] = we[i+j];
                            ofs.write(reinterpret_cast<const char*>(row), sizeof(row));
                        }
                    }

                    Info<< "writeMidPlane: wrote " << totalRows
                        << " rows (binary) to " << fpath << endl;
                }
                else
                {
                    OFstream os(outDir/"midPlane.csv");
                    // midPlane is the base flow for downstream linear-stability
                    // analysis — write at max double precision (17 digits is the
                    // round-trip-safe value for IEEE 754 binary64).
                    os.precision(17);
                    os << "x,y,z,u,v,w,p,omz" << nl;

                    // Interior cells
                    forAll(allData, proci)
                    {
                        const List<scalar>& pd = allData[proci];
                        for (label i = 0; i < pd.size(); i += 8)
                        {
                            os  << pd[i]   << ","
                                << pd[i+1] << ","
                                << pd[i+2] << ","
                                << pd[i+3] << ","
                                << pd[i+4] << ","
                                << pd[i+5] << ","
                                << pd[i+6] << ","
                                << pd[i+7] << nl;
                        }
                    }
                    // Wall extrapolation points
                    forAll(allWallExtrap, proci)
                    {
                        const List<scalar>& we = allWallExtrap[proci];
                        for (label i = 0; i < we.size(); i += 8)
                        {
                            os  << we[i]   << ","
                                << we[i+1] << ","
                                << we[i+2] << ","
                                << we[i+3] << ","
                                << we[i+4] << ","
                                << we[i+5] << ","
                                << we[i+6] << ","
                                << we[i+7] << nl;
                        }
                    }

                    Info<< "writeMidPlane: wrote " << totalRows
                        << " rows (csv) to " << os.name() << endl;
                }

                // ── Write wall coordinates ──
                label totalWallPts = 0;
                forAll(allWall, proci)
                {
                    totalWallPts += allWall[proci].size() / 2;
                }

                if (totalWallPts > 0)
                {
                    OFstream wos(outDir/"wallCoordinates.csv");
                    wos.precision(10);
                    wos << "x,y" << nl;

                    forAll(allWall, proci)
                    {
                        const List<scalar>& wd = allWall[proci];
                        for (label i = 0; i < wd.size(); i += 2)
                        {
                            wos << wd[i] << "," << wd[i+1] << nl;
                        }
                    }

                    Info<< "writeMidPlane: wrote " << totalWallPts
                        << " wall points to " << wos.name() << endl;
                }

                // ── Write wall quantities (x, s, p, dudy, y+) ──
                // dudy is the signed ∂u/∂y at the wall — zero crossing
                // indicates separation.
                label totalWallQ = 0;
                forAll(allWallQ, proci)
                {
                    totalWallQ += allWallQ[proci].size() / 5;
                }

                if (totalWallQ > 0)
                {
                    OFstream qos(outDir/"wallQuantities.csv");
                    qos.precision(10);
                    qos << "x,s,p,dudy,yPlus" << nl;

                    forAll(allWallQ, proci)
                    {
                        const List<scalar>& qd = allWallQ[proci];
                        for (label i = 0; i < qd.size(); i += 5)
                        {
                            qos << qd[i]   << "," << qd[i+1] << ","
                                << qd[i+2] << "," << qd[i+3] << ","
                                << qd[i+4] << nl;
                        }
                    }

                    Info<< "writeMidPlane: wrote " << totalWallQ
                        << " wall quantities to " << qos.name() << endl;
                }
            }
        #};
    }
}

// ************************************************************************* //
